---
kind: type
id: T:Autodesk.Revit.UI.TemporaryGraphicsCommandData
source: html/08ada443-6a0b-d223-5fa1-896996b8e166.htm
---
# Autodesk.Revit.UI.TemporaryGraphicsCommandData

The context data that can be provided to OnClick(TemporaryGraphicsCommandData) .

## Syntax (C#)
```csharp
public class TemporaryGraphicsCommandData : IExternalData,
	IDisposable
```